tests/resources/directpayment/doBankTransfer/doBankTransferRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com" xmlns:ns2="http://obj.ws.payline.experian.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:doBankTransferRequest>
            <ns1:version>99</ns1:version>
            <ns1:payment>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:action>100</ns2:action>
                <ns2:mode>CPT</ns2:mode>
                <ns2:contractNumber>CB</ns2:contractNumber>
                <ns2:differedActionDate>DiffActDate 11/11/2011</ns2:differedActionDate>
                <ns2:method>Method</ns2:method>
                <ns2:softDescriptor xsi:nil="true"/>
                <ns2:cardBrand>VISA</ns2:cardBrand>
                <ns2:registrationToken xsi:nil="true"/>
                <ns2:cumulatedAmount xsi:nil="true"/>
            </ns1:payment>
            <ns1:creditor>
                <ns2:bic>BIC123</ns2:bic>
                <ns2:iban>IBAN123456789</ns2:iban>
                <ns2:name>Creditor Name</ns2:name>
            </ns1:creditor>
            <ns1:comment>Commentbbbb</ns1:comment>
            <ns1:transactionID>TrsIdyyyy</ns1:transactionID>
            <ns1:orderID>OrderIdaaaa</ns1:orderID>
            <ns1:privateDataList/>
        </ns1:doBankTransferRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>